ankrysm/esp32_ws2812/main/process_events.c
/*
 * process_events.c
 *
 *  Created on: 09.08.2022
 *      Author: andreas
 */

#include "esp32_ws2812.h"

//static void reset_events(T_EVENT *events, char *msg);
//static void check_for_repeat(T_EVENT_GROUP *evtgrp);

T_DISPLAY_OBJECT_DATA object_data_clear = {
	.type=OBJT_CLEAR,
	//.pos=0,
	.len=-1,
	.para.hsv={.h=0,.s=0,.v=0},
	.nxt=NULL
};

T_DISPLAY_OBJECT event_clear = {
	.oid="CLEAR",
	.data = &object_data_clear
};

extern T_TRACK tracks[];

//extern T_EVENT_GROUP *s_event_group_list;
static int extended_logging = true;

/*
static void process_event_group_init(T_EVENT_GROUP *evtgrp) {
	ESP_LOGI(__func__, "started");

	evtgrp->status = EVT_STS_RUNNING; // in most cases

	for(T_EVENT *evt = evtgrp->evt_init_list; evt; evt=evt->nxt ) {

		if ( extended_logging) {
			char buf[64];
			event2text(evt, buf, sizeof(buf));
			ESP_LOGI(__func__,"INIT evt.id='%s', %s", evtgrp->id, buf);
		}
		switch(evt->type) {

		case ET_WAIT: /// wait for Statup
			evtgrp->w_flags |= EVFL_WAIT;
			evtgrp->w_wait_time = evt->para.value;
			evtgrp->status = EVT_STS_STARTING;
			break;

		case ET_WAIT_FIRST: /// wait for first Statup
			if ( evtgrp->w_flags & EVFL_WAIT_FIRST_DONE) {
				break; // not at first init
			}
			evtgrp->w_flags |= EVFL_WAIT;
			evtgrp->w_wait_time = evt->para.value;
			evtgrp->status = EVT_STS_STARTING;
			break;

		case ET_CLEAR:
			evtgrp->w_flags |= EVFL_CLEARPIXEL;
			break;

		case ET_SPEED:
			evtgrp->w_speed = evt->para.value;
			break;

		case ET_SPEEDUP:
			evtgrp->w_acceleration = evt->para.value;
			break;

		case ET_GOTO_POS:
			evtgrp->w_pos = evt->para.value;
			break;

		case ET_SET_BRIGHTNESS:
			evtgrp->w_brightness = evt->para.value;
			break;

		case ET_SET_BRIGHTNESS_DELTA:
			evtgrp->w_brightness_delta = evt->para.value;
			break;

		case ET_SET_OBJECT:
			if (strlen(evt->para.svalue)) {
				strlcpy(evtgrp->w_object_oid, evt->para.svalue, sizeof(evtgrp->w_object_oid));
				if ( extended_logging)
					ESP_LOGI(__func__,"evt.id='%s', tevt.id=%d: new object_oid='%s'", evtgrp->id, evt->id, evtgrp->w_object_oid);
			}
			break;

		case ET_BMP_OPEN:
			bmp_open_url(evtgrp->w_object_oid);
			break;

		default:
			break;
		}
	}
}
// */

static void process_track_element_init(T_TRACK_ELEMENT *ele) {
	ESP_LOGI(__func__, "started");

	ele->status = EVT_STS_RUNNING; // in most cases
	ele->evt_grp_current_status = EVT_STS_READY;

	for(T_EVENT *evt = ele->evtgrp->evt_init_list; evt; evt=evt->nxt ) {

		if ( extended_logging) {
			char buf[64];
			event2text(evt, buf, sizeof(buf));
			ESP_LOGI(__func__,"INIT ele.id=%d, %s", ele->id, buf);
		}
		switch(evt->type) {

		case ET_WAIT: // wait for Statup
			ele->w_flags |= EVFL_WAIT;
			ele->w_wait_time = evt->para.value;
			ele->status = EVT_STS_STARTING;
			break;

		case ET_WAIT_FIRST: /// wait for first Statup
			if ( ele->w_flags & EVFL_WAIT_FIRST_DONE) {
				break; // not at first init
			}
			ele->w_flags |= EVFL_WAIT;
			ele->w_wait_time = evt->para.value;
			ele->status = EVT_STS_STARTING;
			break;

		case ET_CLEAR:
			ele->w_flags |= EVFL_CLEARPIXEL;
			break;

		case ET_SPEED:
			ele->w_speed = evt->para.value;
			break;

		case ET_SPEEDUP:
			ele->w_acceleration = evt->para.value;
			break;

		case ET_GOTO_POS:
			ele->w_pos = evt->para.value;
			break;

		case ET_SET_BRIGHTNESS:
			ele->w_brightness = evt->para.value;
			break;

		case ET_SET_BRIGHTNESS_DELTA:
			ele->w_brightness_delta = evt->para.value;
			break;

		case ET_SET_OBJECT:
			if (strlen(evt->para.svalue)) {
				strlcpy(ele->w_object_oid, evt->para.svalue, sizeof(ele->w_object_oid));
				if ( extended_logging)
					ESP_LOGI(__func__,"ele.id=%d, tevt.id=%d: new object_oid='%s'", ele->id, evt->id, ele->w_object_oid);
			}
			break;

		case ET_BMP_OPEN:
			bmp_open_url(ele->w_object_oid);
			break;

		default:
			break;
		}
	}
}

/*
static void process_event_group_starting(T_EVENT_GROUP *evtgrp, uint64_t scene_time, uint64_t timer_period){
	//ESP_LOGI(__func__, "started");

	int nproc=0;
	for(T_EVENT *evt = evtgrp->evt_init_list; evt; evt=evt->nxt ) {

		switch (evt->type) {
		case ET_WAIT:
		case ET_WAIT_FIRST:
			nproc++;
			evtgrp->w_wait_time -= timer_period;
			if (evtgrp->w_wait_time <=0) {
				// timer ends, event done, reset wait flag
				evtgrp->status = EVT_STS_RUNNING;
				evtgrp->w_flags &= ~EVFL_WAIT;
				if ( extended_logging) {
					char buf[64];
					event2text(evt, buf, sizeof(buf));
					ESP_LOGI(__func__,"finished evt.id='%s, %s'", evtgrp->id, buf);
				}
			}
			break;

		default:
			break;
		}
	}

	if (!nproc) {
		// no starting events
		ESP_LOGW(__func__, "no starting events");
		evtgrp->status = EVT_STS_RUNNING;
	}
}
// */
static void process_track_element_starting(T_TRACK_ELEMENT *ele, uint64_t scene_time, uint64_t timer_period){
	//ESP_LOGI(__func__, "started");

	int nproc=0;
	for(T_EVENT *evt = ele->evtgrp->evt_init_list; evt; evt=evt->nxt ) {

		switch (evt->type) {
		case ET_WAIT:
		case ET_WAIT_FIRST:
			nproc++;
			ele->w_wait_time -= timer_period;
			if (ele->w_wait_time <=0) {
				// timer ends, event done, reset wait flag
				ele->status = EVT_STS_RUNNING;
				ele->w_flags &= ~EVFL_WAIT;
				if ( extended_logging) {
					char buf[64];
					event2text(evt, buf, sizeof(buf));
					ESP_LOGI(__func__,"finished ele.id=%d, %s'", ele->id, buf);
				}
			}
			break;

		default:
			break;
		}
	}

	if (!nproc) {
		// no starting events
		ESP_LOGW(__func__, "no starting events");
		ele->status = EVT_STS_RUNNING;
	}
}

/*
static void process_event_group_final(T_EVENT_GROUP *evtgrp) {
	ESP_LOGI(__func__, "started");
	for(T_EVENT *evt = evtgrp->evt_final_list; evt; evt=evt->nxt ) {

		if ( extended_logging) {
			char buf[64];
			event2text(evt, buf, sizeof(buf));
			ESP_LOGI(__func__,"FINAL evt.id='%s', pos=%.2f, %s", evtgrp->id, evtgrp->w_pos, buf);
		}
		switch(evt->type) {

		case ET_CLEAR:
			evtgrp->w_flags |= EVFL_CLEARPIXEL;
			break;

		case ET_BMP_CLOSE:
			bmp_stop_processing();
			evtgrp->w_bmp_remaining_lines = 0;
			break;

		default:
			break;
		}
	}
}
*/

