ankrysm/esp32_ws2812/main/process_events.c
static void process_track_element_final(T_TRACK_ELEMENT *ele) {
	ESP_LOGI(__func__, "started");
	for(T_EVENT *evt = ele->evtgrp->evt_final_list; evt; evt=evt->nxt ) {

		if ( extended_logging) {
			char buf[64];
			event2text(evt, buf, sizeof(buf));
			ESP_LOGI(__func__,"FINAL ele.id=%d, pos=%.2f, %s", ele->id, ele->w_pos, buf);
		}
		switch(evt->type) {

		case ET_CLEAR:
			ele->w_flags |= EVFL_CLEARPIXEL;
			break;

		case ET_BMP_CLOSE:
			bmp_stop_processing();
			ele->w_bmp_remaining_lines = 0;
			break;

		default:
			break;
		}
	}
}


// process the current working event of a track element,
// if finished, start the next
// time values in ms
// sets several parameters
static void  process_track_element_work(T_TRACK_ELEMENT *ele, uint64_t scene_time, uint64_t timer_period) {
	if (!ele->evt_work_current) {
		ESP_LOGW(__func__, "ele.id=%d: no evt_work_current", ele->id );
		return; // no events
	}

	// ************ WORK Events **************************
	while(ele->evt_work_current) {

		if (ele->evt_grp_current_status == EVT_STS_READY ) {
			// initialize work event
			ESP_LOGI(__func__, "ele.id=%d, READY", ele->id);
			ele->evt_grp_current_status = EVT_STS_FINISHED; // in most cases

			switch(ele->evt_work_current->type) {
			case ET_WAIT:
				ele->w_flags |= EVFL_WAIT;
				ele->w_wait_time = ele->evt_work_current->para.value;
				ele->evt_grp_current_status = EVT_STS_RUNNING;
				break;
			case ET_PAINT:
				ele->w_wait_time = ele->evt_work_current->para.value;
				ele->evt_grp_current_status = EVT_STS_RUNNING;
				break;
			case ET_DISTANCE:
				ele->w_distance = ele->evt_work_current->para.value;
				ele->evt_grp_current_status = EVT_STS_RUNNING;
				break;
			case ET_SPEED:
				ele->w_speed = ele->evt_work_current->para.value;
				break;
			case ET_SPEEDUP:
				ele->w_acceleration = ele->evt_work_current->para.value;
				break;
			case ET_BOUNCE:
				ele->w_speed = -ele->w_speed;
				break;
			case ET_REVERSE:
				ele->delta_pos = ele->delta_pos < 0 ? +1 : -1;
				break;
			case ET_GOTO_POS:
				ele->w_pos = ele->evt_work_current->para.value;
				break;
			case ET_CLEAR:
				ele->w_flags |= EVFL_CLEARPIXEL;
				break;
			case ET_SET_BRIGHTNESS:
				ele->w_brightness = ele->evt_work_current->para.value;
				break;
			case ET_SET_BRIGHTNESS_DELTA:
				ele->w_brightness_delta = ele->evt_work_current->para.value;
				break;
			case ET_SET_OBJECT:
				if (strlen(ele->evt_work_current->para.svalue)) {
					strlcpy(ele->w_object_oid, ele->evt_work_current->para.svalue, sizeof(ele->w_object_oid));
					if ( extended_logging)
						ESP_LOGI(__func__,"ele.id=%d, tevt.id=%d: new object_oid='%s'", ele->id, ele->evt_work_current->id, ele->w_object_oid);
				}
				break;
			case ET_BMP_OPEN:
				bmp_open_url(ele->w_object_oid);
				break;
			case ET_BMP_READ:
				ele->w_bmp_remaining_lines = ele->evt_work_current->para.value;
				ele->evt_grp_current_status = EVT_STS_RUNNING;
				break;
			case ET_BMP_CLOSE:
				//evtgrp->w_flags |= EVFL_BMP_CLOSE;
				bmp_stop_processing();
				ele->w_bmp_remaining_lines = 0;
				break;

			default:
				//ESP_LOGW(__func__,"evt.id=%d, tevt.id=%d: timer of %llu ms, type %d expired, NYI", evt->id, tevt->id, tevt->time, tevt->type);
				break;
			}

		} // if READY

		if ( ele->evt_grp_current_status == EVT_STS_FINISHED) {
			// current event finished, try the next
			if ( extended_logging) {
				char buf[64];
				event2text(ele->evt_work_current, buf, sizeof(buf));
				ESP_LOGI(__func__,"event finished ele.id=%d, %s", ele->id, buf);

			}
			ele->evt_work_current = ele->evt_work_current->nxt;
			continue;
		}

		// **** here always: EVT_STS_RUNNING ******
		switch (ele->evt_work_current->type) {
		case ET_WAIT:
			ele->w_wait_time -= timer_period;
			if (ele->w_wait_time <=0) {
				// timer ends, event done, reset wait flag
				ele->evt_grp_current_status = EVT_STS_FINISHED;
				ele->w_flags &= ~EVFL_WAIT;
			}
			break;
		case ET_PAINT:
			ele->w_wait_time -= timer_period;
			if (ele->w_wait_time <=0) {
				// timer ends
				ele->evt_grp_current_status = EVT_STS_FINISHED;
			}
			break;
		case ET_DISTANCE:
			ele->w_distance -= fabs(ele->w_speed);
			if ( ele->w_distance <= 0.0) {
				// distance reached
				ele->evt_grp_current_status = EVT_STS_FINISHED;
			}
			break;
		case ET_BMP_READ:
			if ( !get_is_bmp_reading()) {
				ESP_LOGI(__func__,"bmp_read_data: all data read");
				ele->evt_grp_current_status = EVT_STS_FINISHED;
				break;
			}

			// if remaining lines < 0 wait for EOF
			if (ele->w_bmp_remaining_lines > 0) {
				ESP_LOGI(__func__,"remaining lines %lld",ele->w_bmp_remaining_lines);
				(ele->w_bmp_remaining_lines)--;
				if ( ele->w_bmp_remaining_lines == 0) {
					ESP_LOGI(__func__,"bmp_read_data: all lines read");
					bmp_stop_processing();
					ele->evt_grp_current_status = EVT_STS_FINISHED;
				}
			}
			break;
		default:
			// should not happen here
			ele->evt_grp_current_status = EVT_STS_FINISHED;
			break;
		}

		// if a running event finished
		if ( ele->evt_grp_current_status == EVT_STS_FINISHED) {
			ele->evt_work_current = ele->evt_work_current->nxt;
			continue;
		}
		break; // because of the RUNNING event not finished yet
	} // while

	if ( ! ele->evt_work_current) {
		// no more event, track element finished
		ele->status = EVT_STS_FINISHED;
		ESP_LOGI(__func__, "ele.id=%d: ALL DONE", ele->id);
	}

//	if (!evt) {
//		// no more events
//		check_for_repeat(evtgrp);
//		if ( evtgrp->status == EVT_STS_FINISHED) {
//			// all done
//			ESP_LOGI(__func__, "evt.id='%s': repeat events (%d/%d) ALL DONE", evtgrp->id, evtgrp->w_t_repeats, evtgrp->t_repeats);
//			return;
//		}
//		// next turn, reset events
//		reset_event_group(evtgrp);
//		evtgrp->w_flags |= EVFL_WAIT_FIRST_DONE;
//		// status is set to READY
//		//needs to be RUNNING
//		//evtgrp->status = EVT_STS_RUNNING;
//	}
}

/*
void  process_event_group_work(T_EVENT_GROUP *evtgrp, uint64_t scene_time, uint64_t timer_period) {
	if (!evtgrp->evt_work_list) {
		return; // no events
	}

