ankrysm/esp32_ws2812/main/process_events.c
	// ************ WORK Events **************************
	//bool check_for_repeat = false;
	T_EVENT *evt = evtgrp->evt_work_list;
	T_EVENT *evt_next;
	while(evt) {

		if ( evt->status == EVT_STS_FINISHED ) {
			// already finished
			evt = evt->nxt;
			continue;
		}

		if ( evt->status == EVT_STS_READY ) {
			// initialize work event
			evt->status = EVT_STS_FINISHED; // in most cases

			switch(evt->type) {
			case ET_WAIT:
				evtgrp->w_flags |= EVFL_WAIT;
				evtgrp->w_wait_time = evt->para.value;
				evt->status = EVT_STS_RUNNING;
				break;
			case ET_PAINT:
				evtgrp->w_wait_time = evt->para.value;
				evt->status = EVT_STS_RUNNING;
				break;
			case ET_DISTANCE:
				evtgrp->w_distance = evt->para.value;
				evt->status = EVT_STS_RUNNING;
				break;
			case ET_SPEED:
				evtgrp->w_speed = evt->para.value;
				break;
			case ET_SPEEDUP:
				evtgrp->w_acceleration = evt->para.value;
				break;
			case ET_BOUNCE:
				evtgrp->w_speed = -evtgrp->w_speed;
				break;
			case ET_REVERSE:
				evtgrp->delta_pos = evtgrp->delta_pos < 0 ? +1 : -1;
				break;
			case ET_GOTO_POS:
				evtgrp->w_pos = evt->para.value;
				break;
			case ET_JUMP_MARKER:
				// find event with marker
				evt_next = find_event4marker(evtgrp->evt_work_list, evt->para.svalue);
				if ( evt_next ) {
					// found a destination, check for repeat
					check_for_repeat(evtgrp);
					if ( evtgrp->status == EVT_STS_FINISHED) {
						if ( extended_logging)
							ESP_LOGI(__func__, "found destination next-id=%d, marker='%s' FINISHED", evt_next->id, evt_next->para.svalue);
						// all remaining events set to finished
						for (;evt; evt = evt->nxt) {
							evt->status = EVT_STS_FINISHED;
						}
						return;
					}
					if ( extended_logging)
						ESP_LOGI(__func__, "found destination tid=%d, marker='%s' jump to", evt_next->id, evt_next->para.svalue);

					evt = evt_next;
					reset_events(evt,"WORK(JUMP)");

				} else {
					ESP_LOGE(__func__, "no event for '%s' found", evt->para.svalue);
				}
				break;
			case ET_CLEAR:
				evtgrp->w_flags |= EVFL_CLEARPIXEL;
				break;
			case ET_SET_BRIGHTNESS:
				evtgrp->w_brightness = evt->para.value;
				break;
			case ET_SET_BRIGHTNESS_DELTA:
				evtgrp->w_brightness_delta = evt->para.value;
				break;
			case ET_SET_OBJECT:
				if (strlen(evt->para.svalue)) {
					strlcpy(evtgrp->w_object_oid, evt->para.svalue, sizeof(evtgrp->w_object_oid));
					if ( extended_logging)
						ESP_LOGI(__func__,"evt.id='%s', tevt.id=%d: new object_oid='%s'", evtgrp->id, evt->id, evtgrp->w_object_oid);
				}
				break;
			case ET_BMP_OPEN:
				bmp_open_url(evtgrp->w_object_oid);
				break;
			case ET_BMP_READ:
				evtgrp->w_bmp_remaining_lines = evt->para.value;
				evt->status = EVT_STS_RUNNING;
				break;
			case ET_BMP_CLOSE:
				//evtgrp->w_flags |= EVFL_BMP_CLOSE;
				bmp_stop_processing();
				evtgrp->w_bmp_remaining_lines = 0;
				break;

			default:
				//ESP_LOGW(__func__,"evt.id=%d, tevt.id=%d: timer of %llu ms, type %d expired, NYI", evt->id, tevt->id, tevt->time, tevt->type);
				break;
			}

		} // if READY

		if ( evt->status == EVT_STS_FINISHED) {
			if ( extended_logging) {
				char buf[64];
				event2text(evt, buf, sizeof(buf));
				ESP_LOGI(__func__,"event finished evt.id='%s', %s", evtgrp->id, buf);

			}
			evt = evt->nxt;
			continue;
		}

		// **** here always: EVT_STS_RUNNING ******
		switch (evt->type) {
		case ET_WAIT:
			evtgrp->w_wait_time -= timer_period;
			if (evtgrp->w_wait_time <=0) {
				// timer ends, event done, reset wait flag
				evt->status = EVT_STS_FINISHED;
				evtgrp->w_flags &= ~EVFL_WAIT;
			}
			break;
		case ET_PAINT:
			evtgrp->w_wait_time -= timer_period;
			if (evtgrp->w_wait_time <=0) {
				// timer ends
				evt->status = EVT_STS_FINISHED;
			}
			break;
		case ET_DISTANCE:
			evtgrp->w_distance -= fabs(evtgrp->w_speed);
			if ( evtgrp->w_distance <= 0.0) {
				// distance reached
				evt->status = EVT_STS_FINISHED;
			}
			break;
		case ET_BMP_READ:
			if ( !get_is_bmp_reading()) {
				ESP_LOGI(__func__,"bmp_read_data: all data read");
				evt->status = EVT_STS_FINISHED;
				break;
			}

			// if remaining lines < 0 wait for EOF
			if (evtgrp->w_bmp_remaining_lines > 0) {
				ESP_LOGI(__func__,"remaining lines %lld",evtgrp->w_bmp_remaining_lines);
				(evtgrp->w_bmp_remaining_lines)--;
				if ( evtgrp->w_bmp_remaining_lines == 0) {
					ESP_LOGI(__func__,"bmp_read_data: all lines read");
					bmp_stop_processing();
					evt->status = EVT_STS_FINISHED;
				}
			}
			break;
		default:
			// should not happen here
			evt->status = EVT_STS_FINISHED;
			break;
		}

		// if a running event finished
		if ( evt->status == EVT_STS_FINISHED) {
			evt = evt->nxt;
			continue;
		}
		break; // because of the RUNNING event not finished yet
	} // while

	if (!evt) {
		// no more events
		check_for_repeat(evtgrp);
		if ( evtgrp->status == EVT_STS_FINISHED) {
			// all done
			ESP_LOGI(__func__, "evt.id='%s': repeat events (%d/%d) ALL DONE", evtgrp->id, evtgrp->w_t_repeats, evtgrp->t_repeats);
			return;
		}
		// next turn, reset events
		reset_event_group(evtgrp);
		evtgrp->w_flags |= EVFL_WAIT_FIRST_DONE;
		// status is set to READY
		//needs to be RUNNING
		//evtgrp->status = EVT_STS_RUNNING;
	}
}
//*/

/**
 * main function
 * process an event group, calculate time dependend events,
 * show the pixel
 * calculate parameter for next cycle
 * /
void process_event_group_main(T_EVENT_GROUP *evtgrp, uint64_t scene_time, uint64_t timer_period) {

	if ( evtgrp->status ==  EVT_STS_FINISHED) {
		return; // nothing to do anymore
	}

	if ( evtgrp->status ==  EVT_STS_READY) {
		// **** process INIT events *************
		process_event_group_init(evtgrp);
	}

	if ( evtgrp->status == EVT_STS_STARTING) {
		// **** process STARTINFG events (wait) ****
		process_track_element_starting(evtgrp, scene_time, timer_period);
		if ( evtgrp->status == EVT_STS_STARTING ) {
			// starting event not finished yet
			return;
		}
	}

	// here the status is always "running"

	//ESP_LOGI(__func__, "start process_event_when evtgrp=%s, t=%llu", evtgrp->id, scene_time);
	process_event_group_work(evtgrp, scene_time, timer_period);

	if ( evtgrp->status == EVT_STS_FINISHED ) {
		process_event_group_final(evtgrp);
		process_object(evtgrp);
		return; // not necessary to do more
	}

	//ESP_LOGI(__func__, "start process_event_what evt=%d", evt->id);
	process_object(evtgrp);

	// next timestep
	evtgrp->time += timer_period;

	if ( evtgrp->w_flags & EVFL_WAIT )
		return; // no changes while wait


