ankrysm/esp32_ws2812/main/process_events.c
	// calculate speed and length
	// v = a * t
	// Δv = a * Δt
	// speed is leds per ms
	evtgrp->w_speed += evtgrp->w_acceleration;

	evtgrp->w_len_factor += evtgrp->w_len_factor_delta;
	if ( evtgrp->w_len_factor < 0.0 ) {
		evtgrp->w_len_factor = 0.0;
	} else if ( evtgrp->w_len_factor > 1.0 ) {
		evtgrp->w_len_factor = 1.0;
	}

	evtgrp->w_brightness += evtgrp->w_brightness_delta;
	if ( evtgrp->w_brightness < 0.0)
		evtgrp->w_brightness = 0.0;
	else if(evtgrp->w_brightness > 1.0)
		evtgrp->w_brightness = 1.0;

	evtgrp->w_pos += evtgrp->w_speed;

	//ESP_LOGI(__func__, "finished evt=%d", evt->id);
	//return false;

}
// */
// ************************************************************************************

/*
void process_scene(T_SCENE *scene, uint64_t scene_time, uint64_t timer_period) {

//	ESP_LOGI(__func__,"start t=%llu, tp=%llu", scene_time, timer_period);
	T_EVENT_GROUP *event_groups = scene->event_groups;

	if ( !event_groups ) {
		scene->status = EVT_STS_FINISHED;
		return;
	}

	if ( scene->status == EVT_STS_FINISHED)
		return;

	if ( scene->status == EVT_STS_READY) {
		reset_scene(scene);
		scene->status = EVT_STS_RUNNING;
	}

	// scene status is EVT_STS_RUNNING here
	bool finished = true;
	for ( ; scene->event_group; scene->event_group = scene->event_group->nxt) {

		if (scene->event_group->status == EVT_STS_FINISHED) {
			//if ( extended_logging)
				ESP_LOGI(__func__,"scene '%s', event group '%s' already finished", scene->id, scene->event_group->id );
			continue; // step over
		}

		// not finished, process it
		process_event_group_main(scene->event_group, scene_time, timer_period);

		if ( scene->event_group->status == EVT_STS_FINISHED) {
			//if ( extended_logging)
				ESP_LOGI(__func__,"scene '%s', event '%s' just finished", scene->id, scene->event_group->id );
			continue;
		} else {
			finished = false;
		}

		break;
	}

	if (finished) {
		scene->status = EVT_STS_FINISHED;
		//if ( extended_logging)
			ESP_LOGI(__func__, "scene '%s' finished", scene->id);
	}
}
// */


static void process_track(T_TRACK *track, uint64_t scene_time, uint64_t timer_period) {

	if ( track->status ==  EVT_STS_FINISHED) {
		return; // all elements finished, track completed, nothing to do anymore
	}

	track->status = EVT_STS_RUNNING;

	while ( track->current_element) {

		if ( track->current_element->status == EVT_STS_READY) {
			// **** process INIT events *************
			process_track_element_init(track->current_element);
		}

		if ( track->current_element->status == EVT_STS_STARTING) {
			// **** process STARTING events (wait) ****
			process_track_element_starting(track->current_element, scene_time, timer_period);
			if ( track->current_element->status == EVT_STS_STARTING ) {
				// starting events in progress, enough for now
				return;
			}
		}

		// here the status is always "running"

		//ESP_LOGI(__func__, "start process_event_when evtgrp=%s, t=%llu", evtgrp->id, scene_time);
		process_track_element_work(track->current_element, scene_time, timer_period);

		if ( track->current_element->status == EVT_STS_FINISHED ) {
			process_track_element_final(track->current_element);
			process_object(track->current_element);

			// next track element
			track->current_element = track->current_element->nxt;
			continue;
			//return; // not necessary to do more
		}

		//ESP_LOGI(__func__, "start process_event_what evt=%d", evt->id);
		process_object(track->current_element);

		// next timestep
		track->current_element->time += timer_period;

		if ( track->current_element->w_flags & EVFL_WAIT )
			return; // no changes while wait

		// calculate speed and length factor
		// v = a * t
		// Δv = a * Δt
		// speed is leds per ms
		track->current_element->w_speed += track->current_element->w_acceleration;

		track->current_element->w_len_factor += track->current_element->w_len_factor_delta;
		if ( track->current_element->w_len_factor < 0.0 ) {
			track->current_element->w_len_factor = 0.0;
		} else if ( track->current_element->w_len_factor > 1.0 ) {
			track->current_element->w_len_factor = 1.0;
		}

		track->current_element->w_brightness += track->current_element->w_brightness_delta;
		if ( track->current_element->w_brightness < 0.0)
			track->current_element->w_brightness = 0.0;
		else if(track->current_element->w_brightness > 1.0)
			track->current_element->w_brightness = 1.0;

		track->current_element->w_pos += track->current_element->w_speed;

		// nenough for a running track element
		break;
	}

	if ( ! track->current_element) {
		ESP_LOGI(__func__, "track %d finished", track->id);
		track->status = EVT_STS_FINISHED;
	}

	//ESP_LOGI(__func__, "finished evt=%d", evt->id);
	//return false;


}

int process_tracks(uint64_t scene_time, uint64_t timer_period) {
	int active_tracks=0;

	for ( int i=0; i < N_TRACKS; i++) {
		T_TRACK *track = &(tracks[i]);
		if ( ! track->element_list)
			continue; // nothing to process

		process_track(track, scene_time, timer_period);
		if ( track->status != EVT_STS_FINISHED)
			active_tracks++;
	}
	return active_tracks;
}

// ********************** RESET functions *********************************************************

/**
 * resets all timing events starting from the given event
 * /
static void reset_events(T_EVENT *events, char *msg) {
	if ( !events)
		return;

	for ( T_EVENT *evt = events; evt; evt=evt->nxt) {
		evt->status = EVT_STS_READY;
		if (extended_logging)
			ESP_LOGI(__func__, "%s: id=%d: status=%d, event '%s'", msg, evt->id, evt->status, eventype2text(evt->type));
	}
}
//*/

/**
 *  reset an event,
 *  except repeat parameter and working events
 * /
void reset_event_group( T_EVENT_GROUP *evtgrp) {
	evtgrp->status = EVT_STS_READY;
	evtgrp->w_flags = 0;
	evtgrp->w_pos = 0;
	evtgrp->w_len_factor = 1.0;
	evtgrp->w_len_factor_delta = 0.0;
	evtgrp->w_speed = 0.0;
	evtgrp->w_acceleration = 0.0;
	evtgrp->w_brightness = 1.0;
	evtgrp->w_brightness_delta = 0.0;
	evtgrp->w_distance = 0.0;
	evtgrp->w_wait_time = 0;
	evtgrp->w_bmp_remaining_lines = 0;
	evtgrp->time = 0;
	evtgrp->delta_pos = 1;
	memset(evtgrp->w_object_oid,0, LEN_EVT_OID);

