ankrysm/esp32_ws2812/main/process_events.c
	reset_events(evtgrp->evt_init_list, "INIT");
	reset_events(evtgrp->evt_work_list, "WORK");
	reset_events(evtgrp->evt_final_list,"FINAL");

	if ( extended_logging)
		ESP_LOGI(__func__, "event '%s'", evtgrp->id);
}
//*/

/**
 * reset repeat parameter of an event
 * occurs if anything is played, reset also final events
 * /
void reset_event_repeats(T_EVENT_GROUP *evt) {

	evt->w_t_repeats = evt->t_repeats;

	if ( extended_logging)
		ESP_LOGI(__func__, "event '%s' repeates=%d", evt->id, evt->w_t_repeats);

}
// */

/*
void reset_scene(T_SCENE *scene) {
	if ( extended_logging)
		ESP_LOGI(__func__, "scene '%s'", scene->id);
	scene->event_group = scene->event_groups;

	// reset event groups
	for( T_EVENT_GROUP *evtgrp = scene->event_groups; evtgrp; evtgrp=evtgrp->nxt) {
		reset_event_group(evtgrp);
		reset_event_repeats(evtgrp);
	}

}
*/

static void reset_track_element(T_TRACK_ELEMENT *ele) {
	ele->status = EVT_STS_READY;
	ele->evt_grp_current_status = EVT_STS_READY;
	ele->w_repeats = ele->repeats;
	ele->w_flags = 0;
	ele->w_pos = 0;
	ele->w_len_factor = 1.0;
	ele->w_len_factor_delta = 0.0;
	ele->w_speed = 0.0;
	ele->w_acceleration = 0.0;
	ele->w_brightness = 1.0;
	ele->w_brightness_delta = 0.0;
	ele->w_distance = 0.0;
	ele->w_wait_time = 0;
	ele->w_bmp_remaining_lines = 0;
	ele->time = 0;
	ele->delta_pos = 1;
	ele->evt_work_current = ele->evtgrp ? ele->evtgrp->evt_work_list : NULL;
	memset(ele->w_object_oid,0, LEN_EVT_OID);
}

void reset_tracks() {
	ESP_LOGI(__func__,"start");
	for ( int i=0; i < N_TRACKS; i++) {
		T_TRACK *track = &(tracks[i]);
		if ( ! track->element_list)
			continue; // nothing to reset
		for( T_TRACK_ELEMENT *ele = track->element_list; ele; ele = ele->nxt) {
			reset_track_element(ele);
		}
		track->current_element = track->element_list;
		track->status = EVT_STS_READY;
	}
}

/*
static void check_for_repeat(T_EVENT_GROUP *evtgrp) {
	if (evtgrp->t_repeats > 0 ) {
		if ( evtgrp->w_t_repeats > 0) {
			evtgrp->w_t_repeats--;
		}
	} else {
		evtgrp->w_t_repeats = 1; // forever
	}

	if ( evtgrp->w_t_repeats == 0 ) {
		evtgrp->status = EVT_STS_FINISHED;
		if ( extended_logging)
			ESP_LOGI(__func__, "evt.id='%s': repeat events (%d/%d) FINISHED", evtgrp->id, evtgrp->w_t_repeats, evtgrp->t_repeats);
	} else {
		if ( extended_logging)
			ESP_LOGI(__func__, "evt.id='%s': repeat events (%d/%d) CONTINUE", evtgrp->id, evtgrp->w_t_repeats, evtgrp->t_repeats);
	}
}
*/
